tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "mocki-toki/formulae"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Arc browser
cask "arc"
# Discord
cask "discord"
# Ghostty terminal
cask "ghostty"
# Spotify
cask "spotify"
# Daisy disk
cask "daisydisk"
# Enable Windows-like alt-tab
cask "alt-tab"
# Barik is a macOS menu bar replacement, with yabai and AeroSpace support
cask "barik"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
vscode "076923.python-image-preview"
vscode "bradlc.vscode-tailwindcss"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "franneck94.c-cpp-runner"
vscode "mechatroner.rainbow-csv"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "oracle.oracle-java"
vscode "redhat.java"
vscode "tomoki1207.pdf"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
